In [1]:
from datascience import *
import numpy as np

%matplotlib inline
import matplotlib.pyplot as plots
plots.style.use('fivethirtyeight')
import warnings
warnings.simplefilter(action='ignore',category=np.VisibleDeprecationWarning)

# Lecture 11 #

## Simple Lists

In [2]:
[1, 5, 9]

[1, 5, 9]

In [3]:
[1, 5, 'hello', 5.0]

[1, 5, 'hello', 5.0]

## Lists

In [4]:
simple_list = ['hello', 7, 3.14, True]
simple_list

['hello', 7, 3.14, True]

In [5]:
my_array = make_array(1, 2, 3)

crowded_list = [my_array, 'what is going on', -10]
crowded_list

[array([1, 2, 3]), 'what is going on', -10]

In [6]:
Table().with_columns('Numbers', [1, 2, 3])

Numbers
1
2
3

In [7]:
drinks = Table(['Drink', 'Cafe', 'Price'])
drinks

Drink | Cafe | Price

In [8]:
drinks = drinks.with_rows([
    ['Milk Tea', 'Asha', 5.5],
    ['Espresso', 'Strada',  1.75],
    ['Latte',    'Strada',  3.25],
    ['Espresso', "FSM",   2]
])
drinks

Drink    | Cafe   | Price
Milk Tea | Asha   | 5.5
Espresso | Strada | 1.75
Latte    | Strada | 3.25
Espresso | FSM    | 2

## Cross-classification: grouping by two columns

In [9]:
survey = Table.read_table('welcome_survey_fa21.csv')
survey = survey.where('Handedness', are.containing('t-handed'))
survey = survey.where('Handedness', are.not_containing(' handed'))

### Group with two columns

![Do right-handed people tend to sleep on their left side and left-handed people sleep on their right?](handed.png)

In [10]:
survey.group(['Handedness','Sleep position']).show()

### Pivot Tables

In [11]:
survey.pivot('Sleep position', 'Handedness')

Handedness   | On your back | On your left side | On your right side | On your stomach
Left-handed  | 36           | 34                | 30                 | 13
Right-handed | 322          | 296               | 383                | 196

### Group vs Pivot

Need help with group vs pivot?  Try [our visualizer](http://data8.org/interactive_table_functions/).

### Aggregating numerical variables

In [12]:
survey.group('Sleep position', collect=np.average)

Sleep position     | Year average | Extraversion average | Number of textees average | Hours of sleep average | Handedness average | First pant leg average
On your back       |              | 5.31844              | 5.96089                   | 7.03212                |                    |
On your left side  |              | 5.48485              | 6.71212                   | 7.00682                |                    |
On your right side |              | 5.52542              | 7.0339                    | 7.04479                |                    |
On your stomach    |              | 5.76555              | 6.84689                   | 7.13636                |                    |

In [13]:
t = survey.select('Handedness', 'Sleep position', 'Hours of sleep')
t.group(['Handedness','Sleep position'], collect=np.average).show()

In [14]:
survey.pivot('Sleep position', 'Handedness', values='Hours of sleep', collect=np.average)

Handedness   | On your back | On your left side | On your right side | On your stomach
Left-handed  | 6.68056      | 7.13235           | 7.23333            | 7
Right-handed | 7.07143      | 6.9924            | 7.03003            | 7.14541

In [15]:
# Here, pivot doesn't know how to combine all the hours of sleep
# for each subgroup of students
survey.pivot('Sleep position', 'Handedness', values='Hours of sleep')

TypeError: values requires collect to be specified

## Challenge Question ##

In [16]:
sky = Table.read_table('skyscrapers_v2.csv')
sky = (sky.with_column('age', 2020 - sky.column('completed'))
          .drop('completed'))
sky.show(3)

In [17]:
# 1. For each city, what’s the tallest building for each material?

sky.select("city", "material", "height").group(["city", "material"], collect=max)

city      | material        | height max
Atlanta   | concrete        | 264.25
Atlanta   | mixed/composite | 311.8
Atlanta   | steel           | 169.47
Austin    | concrete        | 208.15
Austin    | steel           | 93.6
Baltimore | concrete        | 161.24
Baltimore | steel           | 155.15
Boston    | concrete        | 121.92
Boston    | mixed/composite | 139
Boston    | steel           | 240.79
... (81 rows omitted)

In [18]:
# 2. For each city, what’s the height difference between the tallest 
#    steel building and the tallest concrete building?

sky_tallest = sky.pivot("material", "city", values="height", collect=max)
sky_tallest = sky_tallest.with_column(
    "height difference",
    np.abs(sky_tallest.column("concrete") - sky_tallest.column("steel"))
)
sky_tallest

city       | concrete | mixed/composite | steel  | height difference
Atlanta    | 264.25   | 311.8           | 169.47 | 94.78
Austin     | 208.15   | 0               | 93.6   | 114.55
Baltimore  | 161.24   | 0               | 155.15 | 6.09001
Boston     | 121.92   | 139             | 240.79 | 118.87
Charlotte  | 265.48   | 239.7           | 179.23 | 86.25
Chicago    | 423.22   | 306.94          | 442.14 | 18.92
Cincinnati | 125      | 202.69          | 175    | 50
Cleveland  | 125      | 288.65          | 215.8  | 90.8
Columbus   | 79.25    | 0               | 169.3  | 90.05
Dallas     | 176.48   | 280.72          | 270.06 | 93.58
... (25 rows omitted)

Don't read ahead until you try the challenge questions yourself first!

In [19]:
sky.select('material', 'city', 'height').group(['city', 'material'], collect=max)

city      | material        | height max
Atlanta   | concrete        | 264.25
Atlanta   | mixed/composite | 311.8
Atlanta   | steel           | 169.47
Austin    | concrete        | 208.15
Austin    | steel           | 93.6
Baltimore | concrete        | 161.24
Baltimore | steel           | 155.15
Boston    | concrete        | 121.92
Boston    | mixed/composite | 139
Boston    | steel           | 240.79
... (81 rows omitted)

In [20]:
sky_p = sky.pivot('material', 'city', values='height', collect=max)
sky_p.show()

In [21]:
sky_p = sky_p.with_column(
    'difference', 
    abs(sky_p.column('steel') - sky_p.column('concrete'))
)
sky_p

city       | concrete | mixed/composite | steel  | difference
Atlanta    | 264.25   | 311.8           | 169.47 | 94.78
Austin     | 208.15   | 0               | 93.6   | 114.55
Baltimore  | 161.24   | 0               | 155.15 | 6.09001
Boston     | 121.92   | 139             | 240.79 | 118.87
Charlotte  | 265.48   | 239.7           | 179.23 | 86.25
Chicago    | 423.22   | 306.94          | 442.14 | 18.92
Cincinnati | 125      | 202.69          | 175    | 50
Cleveland  | 125      | 288.65          | 215.8  | 90.8
Columbus   | 79.25    | 0               | 169.3  | 90.05
Dallas     | 176.48   | 280.72          | 270.06 | 93.58
... (25 rows omitted)

In [22]:
sky_p.sort('difference', True)

city              | concrete | mixed/composite | steel  | difference
Sunny Isles Beach | 196      | 0               | 0      | 196
Las Vegas         | 350.22   | 195.68          | 164.6  | 185.62
Miami Beach       | 170.39   | 0               | 0      | 170.39
Pittsburgh        | 89.3     | 172             | 256.34 | 167.04
Los Angeles       | 145.7    | 118.26          | 310.29 | 164.59
Philadelphia      | 157.89   | 296.73          | 288.04 | 130.15
Boston            | 121.92   | 139             | 240.79 | 118.87
Austin            | 208.15   | 0               | 93.6   | 114.55
Seattle           | 138.69   | 284.38          | 235.31 | 96.62
Atlanta           | 264.25   | 311.8           | 169.47 | 94.78
... (25 rows omitted)

### Take-home question: try it here!

In [23]:
# Generate a table of the names of the oldest buildings for each 
# material for each city:

sky

name                              | material        | city          | height | age
One World Trade Center            | mixed/composite | New York City | 541.3  | 6
Willis Tower                      | steel           | Chicago       | 442.14 | 46
432 Park Avenue                   | concrete        | New York City | 425.5  | 5
Trump International Hotel & Tower | concrete        | Chicago       | 423.22 | 11
Empire State Building             | steel           | New York City | 381    | 89
Bank of America Tower             | mixed/composite | New York City | 365.8  | 11
Stratosphere Tower                | concrete        | Las Vegas     | 350.22 | 24
Aon Center                        | steel           | Chicago       | 346.26 | 47
John Hancock Center               | steel           | Chicago       | 343.69 | 51
Chrysler Building                 | steel           | New York City | 318.9  | 90
... (1771 rows omitted)

In [24]:
def get_name(city, material, age):
    return sky.where("city", are.equal_to(city))\
              .where("material", are.equal_to(material))\
              .where("age", are.equal_to(age))\
              .column("name")

sky_oldest = sky.select("city", "material", "age").group(["city", "material"], collect=max)

sky_oldest = sky_oldest.with_columns(
    "name list",
    sky_oldest.apply(get_name, "city", "material", "age max")
)

sky_oldest

city      | material        | age max | name list
Atlanta   | concrete        | 44      | ['Westin Peachtree Plaza']
Atlanta   | mixed/composite | 33      | ['One Atlantic Center']
Atlanta   | steel           | 123     | ['FlatironCity']
Austin    | concrete        | 36      | ['One American Center']
Austin    | steel           | 83      | ['University of Texas Tower']
Baltimore | concrete        | 53      | ['Charles Towers North Apartments']
Baltimore | steel           | 109     | ['Emerson Tower']
Boston    | concrete        | 49      | ['Harbor Towers I' 'Harbor Towers II']
Boston    | mixed/composite | 28      | ['Ellison Building']
Boston    | steel           | 105     | ["Marriott's Custom House"]
... (81 rows omitted)

## Joins ##

In [25]:
drinks

Drink    | Cafe   | Price
Milk Tea | Asha   | 5.5
Espresso | Strada | 1.75
Latte    | Strada | 3.25
Espresso | FSM    | 2

In [26]:
discounts = Table().with_columns(
    'Coupon % off', make_array(10, 25, 5),
    'Location', make_array('Asha', 'Strada', 'Asha')
)
discounts

Coupon % off | Location
10           | Asha
25           | Strada
5            | Asha

In [27]:
combined = drinks.join('Cafe', discounts, 'Location')
combined

Cafe   | Drink    | Price | Coupon % off
Asha   | Milk Tea | 5.5   | 10
Asha   | Milk Tea | 5.5   | 5
Strada | Espresso | 1.75  | 25
Strada | Latte    | 3.25  | 25

In [28]:
discounted_frac = 1 - combined.column('Coupon % off') / 100
combined.with_column(
    'Discounted Price', 
    combined.column('Price') * discounted_frac
)

Cafe   | Drink    | Price | Coupon % off | Discounted Price
Asha   | Milk Tea | 5.5   | 10           | 4.95
Asha   | Milk Tea | 5.5   | 5            | 5.225
Strada | Espresso | 1.75  | 25           | 1.3125
Strada | Latte    | 3.25  | 25           | 2.4375

In [29]:
drinks.join('Cafe', drinks, 'Cafe')

Cafe   | Drink    | Price | Drink_2  | Price_2
Asha   | Milk Tea | 5.5   | Milk Tea | 5.5
FSM    | Espresso | 2     | Espresso | 2
Strada | Espresso | 1.75  | Espresso | 1.75
Strada | Espresso | 1.75  | Latte    | 3.25
Strada | Latte    | 3.25  | Espresso | 1.75
Strada | Latte    | 3.25  | Latte    | 3.25